---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.String.Text
source: html/bca94fdd-b22c-45fb-2db7-c6290b29c9e9.htm
---
# Autodesk.Revit.DB.SpecTypeId.String.Text Property

Text, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId Text { get; }
```